stress-test/artillery.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      rampTo: 200
      name: "Ramp up"
    - duration: 60
      arrivalRate: 200
      name: "Peak load"
  plugins:
    metrics-by-endpoint: {}

scenarios:
  - name: "Browse catalog"
    weight: 60
    flow:
      - get:
          url: "/api/products"

  - name: "Filter by name"
    weight: 25
    flow:
      - get:
          url: "/api/products"
          qs:
            name: "Аспірин"

  - name: "Health check"
    weight: 15
    flow:
      - get:
          url: "/api/health"